tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/core"
tap "homebrew/cask"
tap "buo/cask-upgrade" # Cask Upgrader

brew "mas" # Mac App Store Manager

brew "git"
brew "mackup"
brew "coreutils"

# Yubikey-Setup
brew "pkcs11-helper"
brew "gnupg"
brew "yubikey-personalization"
brew "hopenpgp-tools"
brew "ykman"
brew "pinentry-mac"
brew "wget"

cask "adobe-acrobat-reader"
cask "bettertouchtool"
cask "firefox"
cask "logitech-presentation"
cask "maccy"
cask "microsoft-teams"
cask "opensc"
cask "rectangle"
cask "signal"
cask "spotify"
cask "steam"
cask "visual-studio-code"
cask "whatsapp"
cask "zoom"
cask "obsidian"

# Mac App Store
mas 'Byword', id: 420212497
mas 'Giphy Capture', id: 668208984
mas 'Keynote', id: 409183694
mas 'MyWoosh', id: 1498889644
mas 'Numbers', id: 409203825
mas 'Speedtest', id: 1153157709
mas 'Things', id: 904280696
mas 'Bitwarden', id: 1352778147
mas 'Pixelmator Pro', id: 1289583905
